In [7]:
import numpy as np
import pandas as pd

In [8]:
from numpy.random import randn

In [10]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [11]:
df

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771 -0.340549  0.620269
C -0.599904 -1.152769 -0.353347
D  0.670494 -0.620102 -1.289647

In [12]:
df > -1

   Column1  Column2  Column3
A     True     True     True
B     True     True     True
C     True    False     True
D     True     True    False

In [13]:
df >0

   Column1  Column2  Column3
A     True     True     True
B     True    False     True
C    False    False    False
D     True    False    False

In [14]:
booleanDf = df >0

In [15]:
booleanDf

   Column1  Column2  Column3
A     True     True     True
B     True    False     True
C    False    False    False
D     True    False    False

In [16]:
df[booleanDf]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771       NaN  0.620269
C       NaN       NaN       NaN
D  0.670494       NaN       NaN

In [17]:
df[df>0]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771       NaN  0.620269
C       NaN       NaN       NaN
D  0.670494       NaN       NaN

In [18]:
df[df>-1]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771 -0.340549  0.620269
C -0.599904       NaN -0.353347
D  0.670494 -0.620102       NaN

In [19]:
df

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771 -0.340549  0.620269
C -0.599904 -1.152769 -0.353347
D  0.670494 -0.620102 -1.289647

In [20]:
df["Column1"]

A    1.140763
B    0.425771
C   -0.599904
D    0.670494
Name: Column1, dtype: float64

In [21]:
df["Column1"]>0

A     True
B     True
C    False
D     True
Name: Column1, dtype: bool

In [22]:
df[df["Column1"]>0]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771 -0.340549  0.620269
D  0.670494 -0.620102 -1.289647

In [23]:
df[df["Column1"]>0.5]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
D  0.670494 -0.620102 -1.289647

In [24]:
df[df["Column2"]>0]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866

In [30]:
df[(df["Column1"]>0) & (df["Column2"] >0.5)]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866

In [33]:
df[(df["Column1"]>0) | (df["Column2"] <0.5)]

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771 -0.340549  0.620269
C -0.599904 -1.152769 -0.353347
D  0.670494 -0.620102 -1.289647

In [34]:
df

    Column1   Column2   Column3
A  1.140763  0.859581  0.293866
B  0.425771 -0.340549  0.620269
C -0.599904 -1.152769 -0.353347
D  0.670494 -0.620102 -1.289647

In [35]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"])

In [36]:
df

    Column1   Column2   Column3   Column4
A  1.140763  0.859581  0.293866 -0.235494
B  0.425771 -0.340549  0.620269 -1.047579
C -0.599904 -1.152769 -0.353347  0.150942
D  0.670494 -0.620102 -1.289647  2.363410

In [37]:
df["Column5"]=randn(4)

In [38]:
df

    Column1   Column2   Column3   Column4   Column5
A  1.140763  0.859581  0.293866 -0.235494 -0.823882
B  0.425771 -0.340549  0.620269 -1.047579  0.078859
C -0.599904 -1.152769 -0.353347  0.150942 -0.128049
D  0.670494 -0.620102 -1.289647  2.363410 -0.435117

In [39]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [40]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  1.140763  0.859581  0.293866 -0.235494 -0.823882  newValue1
B  0.425771 -0.340549  0.620269 -1.047579  0.078859  newValue2
C -0.599904 -1.152769 -0.353347  0.150942 -0.128049  newValue3
D  0.670494 -0.620102 -1.289647  2.363410 -0.435117  newValue4

In [41]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  1.140763  0.859581  0.293866 -0.235494 -0.823882
newValue2  0.425771 -0.340549  0.620269 -1.047579  0.078859
newValue3 -0.599904 -1.152769 -0.353347  0.150942 -0.128049
newValue4  0.670494 -0.620102 -1.289647  2.363410 -0.435117

In [42]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  1.140763  0.859581  0.293866 -0.235494 -0.823882  newValue1
B  0.425771 -0.340549  0.620269 -1.047579  0.078859  newValue2
C -0.599904 -1.152769 -0.353347  0.150942 -0.128049  newValue3
D  0.670494 -0.620102 -1.289647  2.363410 -0.435117  newValue4

In [43]:
df.set_index("Column6",inplace=True)

In [44]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  1.140763  0.859581  0.293866 -0.235494 -0.823882
newValue2  0.425771 -0.340549  0.620269 -1.047579  0.078859
newValue3 -0.599904 -1.152769 -0.353347  0.150942 -0.128049
newValue4  0.670494 -0.620102 -1.289647  2.363410 -0.435117

In [45]:
df.index.names

FrozenList(['Column6'])